app/views/entries/index.html.erb

        <td><%= entry.blogger.email %></td>
        <td><% entry.tags.each do |tag| %>
---
SELECT `tags`.* FROM `tags`  WHERE (LOWER(name) = LOWER('sadpanda'))