app/controllers/entries_controller.rb

SELECT `entries`.* FROM `entries`  WHERE `entries`.`user_id` = 3
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `entries`.* FROM `entries`  WHERE (1 = 0)
---
  def index

    if params[:user_id]
      @entries = Entry.where(user_id: params[:user_id])
      @this_user = User.find(params[:user_id]).name
    else
      @entries = Entry.all

INSERT INTO `entries` (`blurb`, `created_at`, `feeling`, `updated_at`, `user_id`) VALUES ('I want this to be my entry and no one elses!', '2014-10-31 17:27:06', 'doody', '2014-10-31 17:27:06', 1)
---
  def create
    @entry = Entry.new(entry_params)
    @entry.user_id = @blogger || "Guest"
    @entry.save

UPDATE `entries` SET `blurb` = 'I started over today. Hopefully I can simply add can can. I also just updated this editing and such', `updated_at` = '2014-10-30 18:08:18' WHERE `entries`.`id` = 1
---
  def update
    @entry.update(entry_params)

DELETE FROM `entries` WHERE `entries`.`id` = 1
---
  def destroy
    @entry.destroy

SELECT  `entries`.* FROM `entries`  WHERE `entries`.`id` = 1 LIMIT 1
---
    def set_entry
      @entry = Entry.find(params[:id])