app/controllers/welcome_controller.rb

SELECT  `entries`.* FROM `entries`   ORDER BY `entries`.`id` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `entries`
---
  def index
    @latest_posts = Entry.all.reverse_order.paginate(:page => params[:page])

SELECT `tags`.* FROM `tags`
---
  def taggings
    @tags = ActsAsTaggableOn::Tag.all